package HW4;

public class first {
    public static void main(String[] args) {
        //int a = 1, i = 0;
        for (int a=0;a<16;a++) {System.out.println(a);}
    }
    
}


// Задача №1

// Необходимо вывести числа от 0 до 15.


// Задача №2

// Необходимо вывести все положительные степени числа 5 которые меньше 10000, вывести результат возведения в степень.


// Задача №3

// Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
// Реализовать 2 варианта: 
// использовать конструкцию if для определения кратности (цикл с шагом 1, i = i + 1);
// без использования конструкции if (шаг цикла на ваше усмотрение).

// Задача №1

// Дан массив:
// int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
// необходимо вывести все нечетные числа из массива.


// Задача №2

// Дан массив:
// int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
// необходимо вывести все значения массива больше 5.


// Задача №3

// Дан массив:
// int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
// необходимо увеличить все значения массива на 15.

