package HW2;

public class one {
    public static void main(String[] args) {
        int a = 5, b = 7;
        int q = a+b;
        int w = a*b;
        int e = a-b;
        int r = a/b;
        int t = a%b;
        boolean isAEven = (a % 2 == 0);
        boolean isBEven = (b % 2 == 0);
        System.out.println(a+" "+b+" "+q+" "+w+" "+e+" "+r+" "+t+" "+isAEven+" "+isBEven);
    }
}


// Задача №1

// Необходимо создать целочисленные переменные a и b, присвоить произвольные значения переменным на ваш выбор и вывести результаты следующих операций с этими переменными: 
// сложение;
// умножение;
// вычитание;
// деление;
// остаток от деления.
// Так же сделать проверку на четность этих переменных и вывести результат.
